IDEA Open Model
FemElement Constructor (Int32, Int32, Int32, Int32)
Compatible with IDEA StatiCa Beta 20.0
 Constructor for quadrilateral element 2D
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public FemElement(
	int node1,
	int node2,
	int node3,
	int node4
)
Public Sub New (
	node1 As Integer,
	node2 As Integer,
	node3 As Integer,
	node4 As Integer
)
Parameters
node1
Type: System.Int32
[Missing <param name="node1"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)"]
node2
Type: System.Int32
[Missing <param name="node2"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)"]
node3
Type: System.Int32
[Missing <param name="node3"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)"]
node4
Type: System.Int32
[Missing <param name="node4"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)"]
See Also
Reference
FemElement Class
FemElement Overload
IdeaRS.OpenModel.Result Namespace